app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "title", "content") VALUES (?, ?, ?, ?)  [["created_at", 2017-03-04 13:00:06 UTC], ["updated_at", 2017-03-04 13:00:06 UTC], ["title", "Post title"], ["content", "Post content"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "updated"], ["updated_at", 2017-03-08 01:52:03 UTC], ["id", 980190962]]

  def set_postparams
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]