app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."post_id" = ?  [["post_id", 2]]
---
  def index
    @tasks = @post.tasks.all

INSERT INTO "tasks" ("created_at", "updated_at", "content", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", 2017-03-08 02:24:19 UTC], ["updated_at", 2017-03-08 02:24:19 UTC], ["content", "dwad"], ["post_id", 1]]
---
  def create
    @task = @post.tasks.build(tasks_params)

    respond_to do |format|
      if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."post_id" = ? AND "tasks"."id" = ? LIMIT ?  [["post_id", 6], ["id", 185], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 185]]
---
  def destroy
    @task = @post.tasks.find(params[:id])
    @task.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_tasks
    @post = Post.find(params[:post_id])